#include <stdio.h>

int main() {
    // กำหนดค่าเริ่มต้นของตัวแปร
    int a = 5, b = 2;
    float x = 3.0, y = 4.5;

    // คำนวณตามนิพจน์แบบเรียงลำดับต่อเนื่อง
    int r1 = a++ * b + (int)y % 3; // คำนวณ r1  ใช้ a=5 (5*2) + (4 % 3) ได้ 11 แล้ว a=6
    int r2 = (a > b) && ((int)x / b < 2); // คำนวณ r2 แทน a=6 แทน b=2(6 > 2) เป็น 1 && (1 < 2) เป็น 1 ดังนั้น True && True ได้ 1
    float r3 = ++x * y - a / 2; // คำนวณ r3 x มีค่าเป็น 4.0 (4.0 * 4.5) - (6 /2) ได้ 15.00
    float r4 = ((x += 1.5) > y) || (b-- > 0); // คำนวณ r4 x มีค่าเป็น 5.5 ดังนั้น 5.5 > 4.5 ได้ True (1.00) และข้าม b-- ทำให้ b=2 เท่าเดิม

    // แสดงผลลัพธ์ออกทางหน้าจอ (Float ทศนิยม 2 ตำแหน่ง)
    
    printf("r1 = %d\n", r1); // Output: 11
    printf("r2 = %d\n", r2); // Output: 1
    printf("r3 = %.2f\n", r3); // Output: 15.00
    printf("r4 = %.2f\n", r4); // Output: 1.00